In [21]:
import numpy as np
import scipy.io
import sklearn.model_selection
import sklearn.tree
from numpy import genfromtxt
from scipy import stats
from sklearn.base import BaseEstimator, ClassifierMixin
import pandas as pd
import io
from collections import Counter
from pip._internal import main as pipmain
data = pd.read_csv('dataset/titanic/titanic_training.csv')
test_data = pd.read_csv('dataset/titanic/titanic_test_data.csv')

In [24]:
data.head()

,pclass,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1.0,female,40.0,1.0,1.0,16966,134.5000,E34,C,1.0
1,3.0,male,33.0,0.0,0.0,345780,9.5000,NaN,S,0.0
2,3.0,male,3.0,4.0,2.0,347077,31.3875,NaN,S,1.0
3,2.0,female,50.0,0.0,1.0,230433,26.0000,NaN,S,1.0
4,3.0,female,16.0,1.0,1.0,2625,8.5167,NaN,C,1.0

In [23]:
test_data.head()

,pclass,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,2.0,female,28.0,0.0,0.0,240929,12.6500,NaN,S
1,3.0,male,24.0,0.0,0.0,SOTON/O.Q. 3101311,7.0500,NaN,S
2,2.0,male,3.0,1.0,1.0,230080,26.0000,F2,S
3,1.0,male,36.0,0.0,0.0,PC 17474,26.3875,E25,S
4,3.0,female,24.0,0.0,0.0,382653,7.7500,NaN,Q

In [17]:
data.columns

Index(['pclass', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare', 'cabin',
       'embarked', 'survived'],
      dtype='object')

In [18]:
test_data = data = pd.read_csv('dataset/titanic/titanic_test_data.csv')
test_data.columns

Index(['pclass', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare', 'cabin',
       'embarked'],
      dtype='object')

In [19]:
path_train = './dataset/titanic/titanic_training.csv'
data = genfromtxt(path_train, delimiter=',', dtype=None, encoding=None)

In [7]:
data

array([['pclass', 'sex', 'age', ..., 'cabin', 'embarked', 'survived'],
       ['1.0', 'female', '40.0', ..., 'E34', 'C', '1'],
       ['3.0', 'male', '33.0', ..., '', 'S', '0'],
       ...,
       ['3.0', 'male', '18.0', ..., '', 'S', '0'],
       ['2.0', 'male', '31.0', ..., '', 'S', '1'],
       ['3.0', 'female', '24.0', ..., 'G6', 'S', '1']], dtype='<U18')

In [12]:
 data = np.delete(data, 0 ,axis=1)

In [13]:
data

array([['age', 'sibsp', 'parch', ..., 'cabin', 'embarked', 'survived'],
       ['40.0', '1.0', '1.0', ..., 'E34', 'C', '1'],
       ['33.0', '0.0', '0.0', ..., '', 'S', '0'],
       ...,
       ['18.0', '1.0', '0.0', ..., '', 'S', '0'],
       ['31.0', '0.0', '0.0', ..., '', 'S', '1'],
       ['24.0', '0.0', '2.0', ..., 'G6', 'S', '1']], dtype='<U18')